[
  [1,"レディース"],
  [2,"メンズ"],
  [3,"ベビー・キッズ"],
  [4,"インテリア・住まい・小物"],
  [5,"本・音楽・ゲーム"],
  [6,"おもちゃ・ホビー・グッズ"],
  [7,"コスメ・香水・美容"],
  [8,"家電・スマホ・カメラ"],
  [9,"スポーツ・レジャー"],
  [10,"ハンドメイド"],
  [11,"チケット"],
  [12,"自動車・オートバイ"],
  [13,"その他"]
].each do |id,name|
    Category.create!({id: id, name: name})
  end

[
  [1,"---"],
  [2,"S"],
  [3,"M"],
  [4,"L"],
  [5,"XL"],
  [6,"20.0"],
  [7,"20.5"],
  [8,"21.0"],
  [9,"21.5"],
  [10,"22.0"],
  [11,"22.5"],
  [12,"23.0"],
  [13,"23.5"],
  [14,"24.0"],
  [15,"24.5"],
  [16,"25.0"],
  [17,"25.5"],
  [18,"26.0"],
  [19,"26.5"],
  [20,"27.0"],
  [21,"27.5"],
  [22,"28.0"],
  [23,"28.5"],
  [24,"29.0"],
  [25,"29.5"],
  [26,"30.0"],
].each do |id,name|
    Size.create!({id: id, name: name})
  end

[
  [1,"-"],
  [2,"シャネル"],
  [3,"ナイキ"],
  [4,"ルイ・ヴィトン"],
  [5,"シュプリーム"],
  [6,"アディダス"]
].each do |id,name|
  BrandsCategory.create!({id: id, name: name})
end 

[
  [1,"新品、未使用"],
  [2,"未使用に近い"],
  [3,"目立った傷や汚れなし"],
  [4,"やや傷や汚れあり"],
  [5,"傷や汚れあり"],
  [6,"全体的に状態が悪い"]
].each do |id,name|
  ItemCondition.create!({id: id, name: name})
end